{
  "app": {
    "name": "Swim Gen",
    "slogan": "KI-gestützter Trainingsplangenerator für Schwimmer und Triathleten.",
    "hero_title": "KI-Generierte Schwimmpläne",
    "hero_description": "Generiere personalisierte Trainingspläne für Schwimmer, Triathleten und Trainer. Beschreibe einfach, was du suchst, und unserer System erstellt ein individuelles Training für dich."
  },
  "header": {
    "home": "Startseite",
    "about": "Über uns"
  },
  "footer": {
    "privacy_legal": "Datenschutz & Rechtliches",
    "privacy_policy": "Datenschutzerklärung",
    "terms_of_service": "Nutzungsbedingungen",
    "impressum": "Impressum",
    "about": "Über uns",
    "contact": "Kontakt",
    "github": "GitHub",
    "copyright": "© 2025 Swim RAG. Erstellt mit Vue.js und TypeScript."
  },
  "form": {
    "describe_training_needs": "Beschreibe hier deine Trainingsbedürfnisse",
    "describe_training_needs_tooltip": "Sei spezifisch bezüglich deiner Ziele, deinem Erfahrungslevel, deiner Zeitvorgaben und deinen Präferenzen um einen passenden Trainingsplan für dein Schwimmtraining zu generieren.",
    "example_placeholder": "Beispiel: Ich benötige ein 45-minütiges Freistil-Ausdauertraining für einen fortgeschrittenen Schwimmer...",
    "show_advanced_settings": "Erweiterte Einstellungen",
    "hide_advanced_settings": "Einstellungen ausblenden",
    "i_feel_lucky": "Überrasch mich",
    "generating": "Generiere...",
    "swimming_strokes": "Schwimmstile",
    "swimming_strokes_tooltip": "Wähle spezifische Schwimmstile aus, auf die der Fokus liegen soll",
    "freestyle": "Freistil",
    "breaststroke": "Brustschwimmen",
    "backstroke": "Rückenschwimmen",
    "butterfly": "Schmetterling",
    "individual_medley": "Lagen",
    "difficulty_level": "Schwierigkeitsgrad",
    "difficulty_non_swimmer": "Nichtschwimmer",
    "difficulty_beginner": "Anfänger",
    "difficulty_advanced": "Fortgeschritten",
    "difficulty_competitive_swimmer": "Leistungsschwimmer",
    "difficulty_elite_athlete": "Top-Athlet",
    "difficulty_level_tooltip": "Pläne nach Erfahrungslevel filtern",
    "any_difficulty": "Beliebiger Schwierigkeitsgrad",
    "training_type": "Trainingstyp",
    "training_type_tooltip": "Pläne nach Trainingsschwerpunkt und Zielen filtern",
    "any_training_type": "Beliebiger Trainingstyp",
    "training_type_technique_training": "Techniktraining",
    "training_type_performance_test": "Leistungstest",
    "training_type_base_endurance": "Grundlagenausdauer",
    "training_type_recovery": "Erholung",
    "training_type_sprint": "Kurzstrecken",
    "training_type_distance": "Langstrecken",
    "training_type_breath_control": "Atemmangel",
    "training_type_race_preparation": "Wettkampfvorbereitung",
    "clear_all_filters": "Alle Filter löschen",
    "generate_training_plan": "Trainingsplan generieren",
    "generating_plan": "Generiere...",
    "request_too_long": "Die Anfrage ist zu lang! Bitte beschränke dich auf 3000 Zeichen."
  },
  "display": {
    "generating_plan_message": "Dein Trainingsplan wird generiert...",
    "amount": "Anzahl",
    "amount_tooltip": "Anzahl der Wiederholungen für die Übung.",
    "distance": "Distanz (m)",
    "distance_tooltip": "Distanz in Metern pro Wiederholung.",
    "break": "Pause",
    "break_tooltip": "Ruhezeit zwischen Wiederholungen oder Sätzen.",
    "content": "Inhalt",
    "content_tooltip": {
      "title": "Gängige Abkürzungen für Schwimmstile und -techniken:",
      "freestyle": "K, Kr, Freistil, F, Fr: Kraulschwimmen (Freistil)",
      "backstroke": "R: Rückenschwimmen",
      "breaststroke": "B, Br: Brustschwimmen",
      "leg_work": "Be: Beinarbeit (Beinarbeit)",
      "butterfly": "S, D: Schmetterling/Delfinschwimmen",
      "individual_medley": "Lagen: Lagenstaffel (Delfin+Rücken+Brust+Kraul)"
    },
    "intensity": "Intensität",
    "intensity_tooltip": {
      "title": "Gängige Abkürzungen für Schwimmintensitäten:",
      "ga": "GA: Grundlagenausdauer - kategorisiert als:",
      "ga1": "GA1: Normale Intensität",
      "ga1_2": "GA1-2: Leicht erhöhte Intensität",
      "ga2": "GA2: Zügiges Schwimmen",
      "sa": "SA: Schnelligkeitsausdauer",
      "ta": "TA: Technikausdauer",
      "tue": "TÜ: Technische Übung",
      "ts": "TS: Technisch Sauber",
      "sprint": "S: Sprint",
      "recovery": "ReKom: Regeneration"
    },
    "total": "Gesamt (m)",
    "total_tooltip": "Gesamtdistanz in Metern für den Übungssatz.",
    "meters_total": "Gesamtdistanz",
    "exercise_sets": "Übungssätze",
    "no_plan_placeholder": "Noch kein Trainingsplan generiert. Verwende das obige Formular, um einen zu erstellen!",
    "done_editing": "Bearbeitung beenden",
    "refine_plan": "Plan verfeinern",
    "export_pdf": "PDF exportieren",
    "exporting": "Exportiere..."
  },
  "privacy_policy": {
    "last_updated": "Zuletzt aktualisiert: 24. August 2025",
    "title": "Datenschutzerklärung",
    "intro": "Diese Datenschutzerklärung erläutert, wie Swim Gen (\"wir\", \"uns\" oder \"unser\") mit Ihren personenbezogenen Daten umgeht, wenn Sie unseren KI-gestützten Trainingsplangenerator nutzen. Wir verpflichten uns, Ihre Privatsphäre zu schützen, und haben unsere Anwendung nach dem Prinzip Privacy-by-Design entwickelt.",
    "privacy_by_design_title": "1. Privacy-by-Design Ansatz",
    "privacy_by_design": "Swim Gen wurde von Grund auf so konzipiert, dass Ihre Privatsphäre geschützt wird. Derzeit arbeitet unsere Anwendung anonym und erhebt, speichert oder verarbeitet keinerlei personenbezogene Daten. Sie können unseren Service nutzen, ohne ein Konto zu erstellen, persönliche Informationen anzugeben oder getrackt zu werden.",
    "info_we_collect_title": "2. Welche Daten wir aktuell erfassen",
    "info_we_collect": "Personenbezogene Daten: Keine. Wir erfassen keine Namen, E-Mail-Adressen oder sonstige personenbezogene Informationen. Kontodaten: Keine. Es sind keine Benutzerkonten oder Authentifizierung erforderlich. Trainingsdaten: Ihre Trainingsplan-Anfragen und generierten Pläne werden nur temporär verarbeitet, um den Service bereitzustellen, aber nicht gespeichert oder mit Ihnen in Verbindung gebracht.",
    "technical_info_title": "3. Technische Informationen",
    "technical_info": "Um unseren Service bereitzustellen, können wir vorübergehend folgende Daten verarbeiten: Trainingsanfragen: Die von Ihnen eingegebenen Texte zur Generierung von Trainingsplänen (werden verarbeitet und verworfen). Sitzungsdaten: Temporäre Browser-Sitzungsinformationen, die für die Funktionalität erforderlich sind. Server-Logs: Technische Protokolle zur Systemwartung (ohne Personenbezug). Diese technischen Daten sind nicht mit Ihrer Identität verknüpft und können nicht zur Identifizierung Ihrer Person verwendet werden.",
    "cookies_title": "4. Cookies und Tracking",
    "cookies": "Kein Tracking: Wir verwenden keine Tracking-, Analyse- oder Marketing-Cookies. Nur essentielle Cookies: Wir setzen gegebenenfalls technisch notwendige Cookies für grundlegende Funktionen (z. B. zur Sitzungsverwaltung) ein, diese dienen jedoch nicht der Identifikation oder Nachverfolgung.",
    "future_data_donation_title": "5. Zukünftige Daten-Spende (optional)",
    "future_data_donation": "In zukünftigen Versionen könnten wir eine optionale Funktion zur Daten-Spende anbieten, um unsere Anwendung zu verbessern. Diese wäre: Vollständig freiwillig - nur mit expliziter Zustimmung, niemals standardmäßig aktiviert. Transparent - Klare Erläuterung, welche Daten geteilt würden. Widerrufbar - Sie können Ihre Einwilligung jederzeit zurückziehen. Anonymisiert - Die Daten werden vor der Nutzung anonymisiert. Bis zur Einführung einer solchen Funktion findet keine Daten-Spende statt.",
    "third_party_title": "6. Dienste Dritter",
    "third_party": "Backend-API: Wir nutzen unseren eigenen Backend-Service zur Generierung der Trainingspläne. Dieser Service folgt denselben Privacy-by-Design-Prinzipien. Keine externen Analysedienste: Wir verwenden weder Google Analytics, Facebook Pixel noch ähnliche Trackingdienste. Keine Social-Media-Integration: Es gibt keine Einbindung von sozialen Netzwerken, die Sie tracken könnten.",
    "gdpr_rights_title": "7. Ihre Rechte nach DSGVO",
    "gdpr_rights": "Auch wenn wir nur minimale Daten erfassen, haben Sie folgende Rechte: Auskunftsrecht: Sie können Auskunft über gespeicherte personenbezogene Daten verlangen. Recht auf Berichtigung: Sie können unrichtige Daten korrigieren lassen. Recht auf Löschung: Sie können die Löschung Ihrer Daten verlangen. Recht auf Einschränkung: Sie können die Verarbeitung Ihrer Daten einschränken lassen. Recht auf Datenübertragbarkeit: Sie können Ihre Daten in einem übertragbaren Format erhalten. Widerspruchsrecht: Sie können der Verarbeitung widersprechen. Recht auf Widerruf: Sie können eine erteilte Einwilligung jederzeit widerrufen. Da wir aktuell keine personenbezogenen Daten speichern, sind die meisten dieser Rechte derzeit nicht relevant, werden aber bei zukünftigen optionalen Funktionen berücksichtigt.",
    "data_security_title": "8. Datensicherheit",
    "data_security": "Wir setzen angemessene technische und organisatorische Sicherheitsmaßnahmen ein, um alle verarbeiteten Daten zu schützen: Verschlüsselung: Sämtliche Datenübertragungen erfolgen verschlüsselt über HTTPS. Keine Datenspeicherung: Es werden keine personenbezogenen Daten gespeichert, wodurch die meisten Risiken entfallen. Sichere Infrastruktur: Unsere Systeme folgen aktuellen Sicherheitsstandards. Regelmäßige Updates: Wir halten unsere Systeme durch Sicherheitsupdates aktuell.",
    "intl_data_transfers_title": "9. Internationale Datenübermittlung",
    "intl_data_transfers": "Da wir keine personenbezogenen Daten erfassen, finden derzeit keine internationalen Datenübermittlungen statt. Sollte sich dies zukünftig ändern, werden wir geeignete Schutzmaßnahmen ergreifen und diese Erklärung entsprechend anpassen. Die Datenverarbeitung erfolgt innerhalb der Europäischen Union (EU) zur Einhaltung der DSGVO.",
    "children_title": "10. Datenschutz für Kinder",
    "children": "Unser Service richtet sich nicht gezielt an Kinder unter 16 Jahren. Da wir keine personenbezogenen Daten erfassen, werden auch keine Daten von Kindern gespeichert.",
    "changes_title": "11. Änderungen dieser Datenschutzerklärung",
    "changes": "Wir können diese Datenschutzerklärung anpassen, um Änderungen unserer Praktiken oder rechtliche Anforderungen zu berücksichtigen. Bei Änderungen: Wird das Datum \"Zuletzt aktualisiert\" oben angepasst. Wesentliche Änderungen werden in der Anwendung deutlich hervorgehoben. Bei gravierenden Änderungen, die Ihre Rechte betreffen, informieren wir Sie zusätzlich. Wir empfehlen, diese Erklärung regelmäßig zu lesen, um zu erfahren, wie wir Ihre Privatsphäre schützen.",
    "contact_title": "12. Kontaktinformationen",
    "contact": "Wenn Sie Fragen zu dieser Datenschutzerklärung oder unseren Datenschutzpraktiken haben, kontaktieren Sie uns bitte: E-Mail: {'info.swim.gen@gmail.com'}. GitHub: 'https://github.com/5pirit5eal/swim-rag'. Datenschutzanfragen: Für spezielle Fragen oder zur Ausübung Ihrer Rechte nach DSGVO nutzen Sie bitte die oben genannte E-Mail-Adresse mit dem Betreff 'Datenschutzanfrage'.",
    "commitment_title": "13. Unser Datenschutz-Versprechen",
    "commitment": "Swim Gen ist eine datenschutzfreundliche Anwendung. Wir sind überzeugt, dass leistungsstarke KI-Tools für Schwimmer und Triathleten auch ohne umfangreiche Datenerhebung möglich sind. Unser Ziel ist es, zu zeigen, dass nützliche Anwendungen mit minimaler Datenerfassung und gleichzeitig exzellenter Nutzererfahrung realisierbar sind."
  },
  "terms_of_service": {
    "last_updated": "Zuletzt aktualisiert: 13. August 2025",
    "title": "Nutzungsbedingungen von Swim Gen",
    "intro": "Diese Bedingungen regeln die Nutzung dieser Anwendung sowie alle damit verbundenen Vereinbarungen oder Rechtsverhältnisse mit dem Betreiber in rechtlich verbindlicher Weise. Großgeschriebene Begriffe sind im entsprechenden Abschnitt dieses Dokuments definiert.",
    "read_carefully": "Bitte lesen Sie dieses Dokument sorgfältig.",
    "provided_by": "Diese Anwendung wird bereitgestellt von:",
    "owner": "Swim Gen",
    "owner_contact": "Kontakt E-Mail des Betreibers: {'info.swim.gen@gmail.com'}",
    "at_a_glance_title": "Wichtige Hinweise auf einen Blick",
    "at_a_glance": "Bitte beachten Sie, dass einige Bestimmungen dieser Bedingungen nur für bestimmte Nutzergruppen gelten. Insbesondere können einzelne Klauseln nur für Verbraucher oder für Nutzer gelten, die nicht als Verbraucher eingestuft werden. Solche Einschränkungen werden immer ausdrücklich in der jeweiligen Klausel erwähnt. Fehlt ein solcher Hinweis, gelten die Klauseln für alle Nutzer.",
    "terms_of_use_title": "NUTZUNGSREGELN",
    "terms_of_use": "Sofern nicht anders angegeben, gelten die in diesem Abschnitt beschriebenen Nutzungsregeln allgemein für die Nutzung dieser Anwendung.",
    "additional_conditions": "In bestimmten Fällen können zusätzliche Nutzungs- oder Zugangsbedingungen gelten, die in diesem Dokument gesondert aufgeführt werden.",
    "requirements": "Mit der Nutzung dieser Anwendung bestätigen Sie, dass Sie folgende Voraussetzungen erfüllen:",
    "requirements_list": [
      "Es bestehen keine Einschränkungen hinsichtlich der Nutzung als Verbraucher oder gewerblicher Nutzer."
    ],
    "content_title": "Inhalte dieser Anwendung",
    "content": "Sofern nicht anders angegeben oder klar erkennbar, sind alle auf dieser Anwendung verfügbaren Inhalte Eigentum des Betreibers oder werden von diesem lizenziert.",
    "content_effort": "Der Betreiber bemüht sich nach besten Kräften, sicherzustellen, dass die bereitgestellten Inhalte keine geltenden Gesetze oder Rechte Dritter verletzen. Dennoch kann dies nicht immer garantiert werden. In solchen Fällen - unbeschadet gesetzlicher Rechte der Nutzer - bitten wir um Mitteilung über die im Dokument angegebenen Kontaktdaten.",
    "rights_title": "Rechte an Inhalten dieser Anwendung - Alle Rechte vorbehalten",
    "rights": "Der Betreiber hält und behält sich alle Rechte an geistigem Eigentum an diesen Inhalten vor.",
    "rights_usage": "Nutzer dürfen diese Inhalte nur im Rahmen der ordnungsgemäßen Nutzung des Dienstes verwenden.",
    "rights_prohibited": "Insbesondere - aber nicht ausschließlich - ist es Nutzern untersagt, Inhalte zu kopieren, herunterzuladen, zu teilen (außer im unten genannten Rahmen), zu verändern, zu übersetzen, zu veröffentlichen, zu übertragen, zu verkaufen, zu unterlizenzieren, zu bearbeiten, an Dritte weiterzugeben oder abgeleitete Werke daraus zu erstellen, noch Dritten dies über das eigene Gerät zu ermöglichen - auch nicht unwissentlich.",
    "rights_personal_use": "Sofern ausdrücklich angegeben, dürfen Nutzer bestimmte Inhalte für den rein persönlichen und nicht-kommerziellen Gebrauch herunterladen, kopieren und/oder teilen, sofern alle Urheberrechts- und sonstigen Hinweise des Betreibers korrekt übernommen werden.",
    "rights_limitation": "Gesetzliche Schranken und Ausnahmen des Urheberrechts bleiben unberührt.",
    "user_content_title": "Von Nutzern bereitgestellte Inhalte",
    "user_content": "Der Betreiber ermöglicht es Nutzern, Inhalte bereitzustellen - insbesondere zur Spende von Trainingsplänen zur Verbesserung des Dienstes.",
    "user_content_confirm": "Mit der Bereitstellung von Inhalten bestätigen Nutzer, hierzu rechtlich befugt zu sein und keine gesetzlichen Bestimmungen oder Rechte Dritter zu verletzen.",
    "external_resources_title": "Zugriff auf externe Ressourcen",
    "external_resources": "Über diese Anwendung können Nutzer auf externe Ressourcen Dritter zugreifen. Nutzer erkennen an, dass der Betreiber keinen Einfluss auf diese Ressourcen hat und daher nicht für deren Inhalte oder Verfügbarkeit haftet.",
    "external_resources_conditions": "Für externe Ressourcen gelten die jeweiligen Nutzungsbedingungen der Drittanbieter oder - falls nicht vorhanden - die gesetzlichen Bestimmungen.",
    "acceptable_use_title": "Zulässige Nutzung",
    "acceptable_use": "Diese Anwendung und der Dienst dürfen nur im Rahmen des vorgesehenen Zwecks, dieser Bedingungen und geltender Gesetze genutzt werden.",
    "acceptable_use_responsibility": "Nutzer sind allein dafür verantwortlich, dass ihre Nutzung dieser Anwendung und/oder des Dienstes keine Gesetze, Vorschriften oder Rechte Dritter verletzt.",
    "acceptable_use_rights": "Der Betreiber behält sich das Recht vor, zum Schutz seiner berechtigten Interessen geeignete Maßnahmen zu ergreifen - z. B. den Zugang zur Anwendung oder zum Dienst zu verweigern, Verträge zu kündigen oder Verstöße an die zuständigen Behörden zu melden -, wenn Nutzer eine der folgenden Handlungen begehen oder im Verdacht stehen:",
    "acceptable_use_list": [
      "Verstoß gegen Gesetze, Vorschriften und/oder diese Bedingungen;",
      "Verletzung von Rechten Dritter;",
      "erhebliche Beeinträchtigung berechtigter Interessen des Betreibers;",
      "Beleidigung des Betreibers oder Dritter."
    ],
    "privacy_policy_title": "Datenschutzerklärung",
    "privacy_policy": "Weitere Informationen zur Verwendung personenbezogener Daten finden Nutzer in der Datenschutzerklärung dieser Anwendung.",
    "ip_rights_title": "Rechte an geistigem Eigentum",
    "ip_rights": "Soweit in diesen Bedingungen nicht anders geregelt, sind sämtliche Rechte an geistigem Eigentum (z. B. Urheberrechte, Markenrechte, Patente, Designrechte) an dieser Anwendung ausschließliches Eigentum des Betreibers oder seiner Lizenzgeber und durch geltende Gesetze und internationale Abkommen geschützt.",
    "ip_rights_trademarks": "Alle Marken - ob bildlich oder wortlich - sowie sonstige Kennzeichen, Handelsnamen, Dienstleistungsmarken, Wortmarken, Illustrationen, Bilder oder Logos im Zusammenhang mit dieser Anwendung sind und bleiben ausschließliches Eigentum des Betreibers oder seiner Lizenzgeber und unterliegen dem Schutz durch geltende Gesetze und internationale Abkommen.",
    "changes_title": "Änderungen dieser Bedingungen",
    "changes": "Der Betreiber behält sich das Recht vor, diese Bedingungen jederzeit zu ändern oder zu ergänzen. In solchen Fällen werden die Nutzer entsprechend informiert.",
    "changes_effect": "Solche Änderungen wirken sich nur auf das zukünftige Vertragsverhältnis mit dem Nutzer aus.",
    "changes_acceptance": "Die fortgesetzte Nutzung des Dienstes gilt als Zustimmung zu den geänderten Bedingungen. Nutzer, die nicht an die Änderungen gebunden sein möchten, müssen die Nutzung einstellen. Die Nichtakzeptanz der neuen Bedingungen kann beiden Parteien das Recht zur Kündigung einräumen.",
    "changes_previous": "Für das Vertragsverhältnis vor Annahme der neuen Bedingungen gilt die vorherige Version. Diese kann beim Betreiber angefordert werden.",
    "changes_law": "Soweit gesetzlich erforderlich, gibt der Betreiber das Inkrafttreten der geänderten Bedingungen bekannt.",
    "assignment_title": "Vertragsübertragung",
    "assignment": "Der Betreiber ist berechtigt, Rechte und Pflichten aus diesen Bedingungen ganz oder teilweise auf Dritte zu übertragen, sofern berechtigte Interessen des Nutzers gewahrt bleiben. Für Änderungen dieser Bedingungen gelten die entsprechenden Regelungen.",
    "assignment_user": "Nutzer dürfen ihre Rechte und Pflichten aus diesen Bedingungen nur mit schriftlicher Zustimmung des Betreibers übertragen.",
    "contacts_title": "Kontakt",
    "contacts": "Sämtliche Mitteilungen im Zusammenhang mit der Nutzung dieser Anwendung sind an die im Dokument angegebenen Kontaktdaten zu richten.",
    "severability_title": "Salvatorische Klausel",
    "severability": "Sollte eine Bestimmung dieser Bedingungen ganz oder teilweise unwirksam oder undurchsetzbar sein, bleibt die Wirksamkeit der übrigen Bestimmungen unberührt.",
    "governing_law_title": "Anwendbares Recht",
    "governing_law": "Diese Bedingungen unterliegen dem Recht am Sitz des Betreibers, wie im entsprechenden Abschnitt dieses Dokuments angegeben, unter Ausschluss kollisionsrechtlicher Vorschriften.",
    "venue_title": "Gerichtsstand",
    "venue": "Für alle Streitigkeiten aus oder im Zusammenhang mit diesen Bedingungen ist ausschließlich das Gericht am Sitz des Betreibers zuständig, wie im entsprechenden Abschnitt dieses Dokuments angegeben.",
    "dispute_title": "Streitbeilegung",
    "amicable_title": "Einvernehmliche Streitbeilegung",
    "amicable": "Nutzer können Streitigkeiten an den Betreiber herantragen, der sich um eine einvernehmliche Lösung bemüht.",
    "amicable_right": "Das Recht der Nutzer, gerichtliche Schritte einzuleiten, bleibt stets unberührt. Bei Streitigkeiten im Zusammenhang mit der Nutzung dieser Anwendung oder des Dienstes werden Nutzer gebeten, den Betreiber über die angegebenen Kontaktdaten zu kontaktieren.",
    "amicable_complaint": "Nutzer können Beschwerden mit einer kurzen Beschreibung und ggf. Angaben zur Bestellung, zum Kauf oder zum Konto an die im Dokument angegebene E-Mail-Adresse des Betreibers senden.",
    "amicable_process": "Der Betreiber bearbeitet Beschwerden unverzüglich und innerhalb von 21 Tagen nach Eingang."
  },
  "errors": {
    "unknown_error": "Ein unbekannter Fehler ist aufgetreten. Bitte versuche es später erneut.",
    "health_check_failed": "Der Systemcheck ist fehlgeschlagen. Bitte versuche es später erneut.",
    "training_plan_failed": "Der Trainingsplan konnte nicht generiert werden. Bitte überprüfen deine Eingaben und versuche es erneut.",
    "failed_to_generate_prompt": "Prompt konnte nicht generiert werden",
    "failed_to_generate_plan": "Plan konnte nicht generiert werden",
    "failed_to_export_plan": "Trainingsplan konnte nicht als PDF exportiert werden.",
    "timeout": "Die Anfrage wurde nach {time} Sekunden abgebrochen. Bitte versuche es erneut.",
    "connection_failed": "Verbindung zum Server fehlgeschlagen. Bitte überprüfe deine Internetverbindung und versuche es erneut."
  }
}
