{
  "app": {
    "name": "Swim Gen",
    "slogan": "KI-gestützter Trainingsplangenerator für Schwimmer und Triathleten.",
    "note_meta": "HINWEIS: Der oben stehende 'name' und 'slogan' werden auch in index.html für OpenGraph/meta verwendet. Ändere diese Werte zusammen mit den Meta-Tags in index.html.",
    "hero_title": "KI-Generierte Schwimmpläne",
    "hero_description": "Generiere personalisierte Trainingspläne für Schwimmer, Triathleten und Trainer. Beschreibe einfach, was du suchst, und unserer System erstellt ein individuelles Training für dich."
  },
  "home": {
    "banner": {
      "not_logged_in": {
        "text": "Wenn du einen zukünftigen Plan speichern oder interaktive Bearbeitung nutzen möchtest, erstelle ein Konto oder melde dich an.",
        "button": "Anmelden"
      },
      "logged_in": {
        "text": "Um diesen Plan in deinem Verlauf anzuzeigen und interaktive Bearbeitung zu nutzen, klicke hier:",
        "button": "Interaktive Bearbeitung"
      }
    }
  },
  "header": {
    "home": "Startseite",
    "about": "Über uns",
    "profile": "Profil"
  },
  "footer": {
    "privacy_legal": "Datenschutz & Rechtliches",
    "privacy_policy": "Datenschutzerklärung",
    "terms_of_service": "Nutzungsbedingungen",
    "impressum": "Impressum",
    "about": "Über uns",
    "contact": "Kontakt",
    "github": "GitHub",
    "roadmap": "Roadmap",
    "sponsor": "Unterstütze dieses Projekt",
    "copyright": "© 2025 Swim Gen. Erstellt mit Vue.js und TypeScript."
  },
  "form": {
    "describe_training_needs": "Beschreibe hier deine Trainingsbedürfnisse",
    "describe_training_needs_tooltip": "Sei spezifisch bezüglich deiner Ziele, deinem Erfahrungslevel, deiner Zeitvorgaben und deinen Präferenzen um einen passenden Trainingsplan für dein Schwimmtraining zu generieren.",
    "example_placeholder": "Beispiel: Ich benötige ein 45-minütiges Freistil-Ausdauertraining für einen fortgeschrittenen Schwimmer...",
    "show_advanced_settings": "Erweiterte Einstellungen",
    "hide_advanced_settings": "Einstellungen ausblenden",
    "i_feel_lucky": "Überrasch mich",
    "generating": "Generiere...",
    "swimming_strokes": "Schwimmstile",
    "swimming_strokes_tooltip": "Wähle spezifische Schwimmstile aus, auf die der Fokus liegen soll",
    "freestyle": "Freistil",
    "breaststroke": "Brustschwimmen",
    "backstroke": "Rückenschwimmen",
    "butterfly": "Schmetterling",
    "individual_medley": "Lagen",
    "difficulty_level": "Schwierigkeitsgrad",
    "difficulty_non_swimmer": "Nichtschwimmer",
    "difficulty_beginner": "Anfänger",
    "difficulty_advanced": "Fortgeschritten",
    "difficulty_competitive_swimmer": "Leistungsschwimmer",
    "difficulty_elite_athlete": "Top-Athlet",
    "difficulty_level_tooltip": "Pläne nach Erfahrungslevel filtern",
    "any_difficulty": "Beliebiger Schwierigkeitsgrad",
    "training_type": "Trainingstyp",
    "training_type_tooltip": "Pläne nach Trainingsschwerpunkt und Zielen filtern",
    "any_training_type": "Beliebiger Trainingstyp",
    "training_type_technique_training": "Techniktraining",
    "training_type_performance_test": "Leistungstest",
    "training_type_base_endurance": "Grundlagenausdauer",
    "training_type_recovery": "Erholung",
    "training_type_sprint": "Kurzstrecken",
    "training_type_distance": "Langstrecken",
    "training_type_breath_control": "Atemmangel",
    "training_type_race_preparation": "Wettkampfvorbereitung",
    "clear_all_filters": "Alle Filter löschen",
    "generate_training_plan": "Trainingsplan generieren",
    "generating_plan": "Generiere...",
    "request_too_long": "Die Anfrage ist zu lang! Bitte beschränke dich auf 3000 Zeichen.",
    "pool_length": "Beckenlänge",
    "pool_length_tooltip": "Die Beckenlänge wird verwendet, um den Trainingsplan zu verfeinern. 25m ist die Standardeinstellung.",
    "pool_length_twenty_five_meters": "25 Meter",
    "pool_length_fifty_meters": "50 Meter",
    "pool_length_open_water": "Freiwasser"
  },
  "display": {
    "generating_plan_message": "Dein Trainingsplan wird generiert...",
    "plan_title": "Kein Titel angegeben.",
    "plan_description": "Keine Beschreibung angegeben.",
    "amount": "Anzahl",
    "amount_tooltip": "Anzahl der Wiederholungen für die Übung.",
    "distance": "Distanz (m)",
    "distance_tooltip": "Distanz in Metern pro Wiederholung.",
    "break": "Pause",
    "break_tooltip": "Ruhezeit zwischen Wiederholungen oder Sätzen.",
    "content": "Inhalt",
    "content_tooltip": {
      "title": "Gängige Abkürzungen für Schwimmstile und -techniken:",
      "freestyle": "K, Kr, Freistil, F, Fr: Kraulschwimmen (Freistil)",
      "backstroke": "R: Rückenschwimmen",
      "breaststroke": "B, Br: Brustschwimmen",
      "leg_work": "Be: Beinarbeit (Beinarbeit)",
      "butterfly": "S, D: Schmetterling/Delfinschwimmen",
      "individual_medley": "Lagen: Lagenstaffel (Delfin+Rücken+Brust+Kraul)"
    },
    "intensity": "Intensität",
    "intensity_tooltip": {
      "title": "Gängige Abkürzungen für Schwimmintensitäten:",
      "ga": "GA: Grundlagenausdauer - kategorisiert als:",
      "ga1": "GA1: Normale Intensität",
      "ga1_2": "GA1-2: Leicht erhöhte Intensität",
      "ga2": "GA2: Zügiges Schwimmen",
      "lza": "LZA: Langzeitausdauer - lange, eher niedrig bis moderat intensive Einheiten zur Ausdauerbasis",
      "hf": "HF: Herzfrequenz - zur Steuerung von Intensität und Belastungszonen verwendet",
      "lt": "LT: Lactate Threshold (Laktatschwelle) - Intensität, bei der Laktat deutlich ansteigt",
      "sa": "SA: Schnelligkeitsausdauer - hohe Intensitäten über mittlere Distanzen",
      "wa": "WA: Wettkampfspezifische Ausdauer - Ausdauer mit Renntempo- und Distanzbezug",
      "wk": "WK: Wettkampf",
      "ta": "TA: Technikausdauer",
      "tue": "TÜ: Technische Übung",
      "ts": "TS: Technisch Sauber",
      "sprint": "S: Sprint",
      "recovery": "ReKom: Regeneration"
    },
    "total": "Gesamt (m)",
    "total_tooltip": "Gesamtdistanz in Metern für den Übungssatz.",
    "meters_total": "Gesamtdistanz",
    "exercise_sets": "Übungssätze",
    "no_plan_placeholder": "Noch kein Trainingsplan generiert. Verwende das obige Formular, um einen zu erstellen!",
    "done_editing": "Bearbeitung beenden",
    "refine_plan": "Plan bearbeiten",
    "export_pdf": "PDF exportieren",
    "exporting": "Exportiert...",
    "open_pdf": "PDF öffnen",
    "export_horizontal": "Horizontal",
    "export_large_font": "Große Schrift",
    "add_row": "Neue Zeile hinzufügen",
    "remove_row": "Diese Zeile entfernen",
    "move_row_up": "Zeile nach oben verschieben",
    "move_row_down": "Zeile nach unten verschieben"
  },
  "impressum": {
    "title": "Impressum",
    "contact_title": "Kontakt",
    "phone": "Telefon",
    "email": "E-Mail"
  },
  "privacy_policy": {
    "title": "Datenschutzerklärung",
    "last_updated": "Zuletzt aktualisiert: 28. August 2025",
    "data_protection_at_a_glance_title": "1. Datenschutz auf einen Blick",
    "general_notes_title": "Allgemeine Hinweise",
    "general_notes_text": "Die folgenden Hinweise geben einen einfachen Überblick darüber, was mit Ihren personenbezogenen Daten passiert, wenn Sie diese Website besuchen. Personenbezogene Daten sind alle Daten, mit denen Sie persönlich identifiziert werden können. Ausführliche Informationen zum Thema Datenschutz entnehmen Sie unserer unter diesem Text aufgeführten Datenschutzerklärung.",
    "data_collection_on_this_website_title": "Datenerfassung auf dieser Website",
    "who_is_responsible_title": "Wer ist verantwortlich für die Datenerfassung auf dieser Website?",
    "who_is_responsible_text": "Die Datenverarbeitung auf dieser Website erfolgt durch den Websitebetreiber. Dessen Kontaktdaten können Sie dem Abschnitt „Hinweis zur Verantwortlichen Stelle“ in dieser Datenschutzerklärung entnehmen.",
    "how_we_collect_data_title": "Wie erfassen wir Ihre Daten?",
    "how_we_collect_data_text": "Wir erheben keine personenbezogenen Daten automatisch. Die einzigen Daten, die wir verarbeiten, sind diejenigen, die Sie uns explizit zur Verfügung stellen, zum Beispiel durch die Eingabe von Trainingsanforderungen in das Formular zur Plangenerierung. Diese Daten werden ausschließlich zur Erstellung des Trainingsplans verwendet und nicht gespeichert.",
    "what_we_use_data_for_title": "Wofür nutzen wir Ihre Daten?",
    "what_we_use_data_for_text": "Die von Ihnen bereitgestellten Daten werden ausschließlich zur der von der Website bereitgestellten Funktionalität genutzt. Es findet keine Speicherung Ihrer Anfragen oder der generierten Pläne statt. Exportierte Pläne werden temporär zwischengespeichert um für den Download bereitzustehen. Wir verwenden keine Daten zur Analyse des Nutzerverhaltens.",
    "your_rights_title": "Welche Rechte haben Sie bezüglich Ihrer Daten?",
    "your_rights_text": "Sie haben jederzeit das Recht, unentgeltlich Auskunft über Herkunft, Empfänger und Zweck Ihrer gespeicherten personenbezogenen Daten zu erhalten. Sie haben außerdem ein Recht, die Berichtigung oder Löschung dieser Daten zu verlangen. Wenn Sie eine Einwilligung zur Datenverarbeitung erteilt haben, können Sie diese Einwilligung jederzeit für die Zukunft widerrufen. Außerdem haben Sie das Recht, unter bestimmten Umständen die Einschränkung der Verarbeitung Ihrer personenbezogenen Daten zu verlangen. Des Weiteren steht Ihnen ein Beschwerderecht bei der zuständigen Aufsichtsbehörde zu. Hierzu sowie zu weiteren Fragen zum Thema Datenschutz können Sie sich jederzeit an uns wenden.",
    "general_and_mandatory_info_title": "2. Allgemeine Hinweise und Pflichtinformationen",
    "data_protection_title": "Datenschutz",
    "data_protection_text": "Die Betreiber dieser Seiten nehmen den Schutz Ihrer persönlichen Daten sehr ernst. Wir behandeln Ihre personenbezogenen Daten vertraulich und entsprechend den gesetzlichen Datenschutzvorschriften sowie dieser Datenschutzerklärung. Wenn Sie diese Website benutzen, werden verschiedene personenbezogene Daten erhoben. Personenbezogene Daten sind Daten, mit denen Sie persönlich identifiziert werden können. Die vorliegende Datenschutzerklärung erläutert, welche Daten wir erheben und wofür wir sie nutzen. Sie erläutert auch, wie und zu welchem Zweck das geschieht. Wir weisen darauf hin, dass die Datenübertragung im Internet (z. B. bei der Kommunikation per E-Mail) Sicherheitslücken aufweisen kann. Ein lückenloser Schutz der Daten vor dem Zugriff durch Dritte ist nicht möglich.",
    "responsible_party_title": "Hinweis zur verantwortlichen Stelle",
    "responsible_party_text": "Die verantwortliche Stelle für die Datenverarbeitung auf dieser Website ist:",
    "responsible_party_definition": "Verantwortliche Stelle ist die natürliche oder juristische Person, die allein oder gemeinsam mit anderen über die Zwecke und Mittel der Verarbeitung von personenbezogenen Daten (z. B. Namen, E-Mail-Adressen o. Ä.) entscheidet.",
    "storage_duration_title": "Speicherdauer",
    "storage_duration_text": "Soweit innerhalb dieser Datenschutzerklärung keine speziellere Speicherdauer genannt wurde, verbleiben Ihre personenbezogenen Daten bei uns, bis der Zweck für die Datenverarbeitung entfällt. Wenn Sie ein berechtigtes Löschersuchen geltend machen oder eine Einwilligung zur Datenverarbeitung widerrufen, werden Ihre Daten gelöscht, sofern wir keine anderen rechtlich zulässigen Gründe für die Speicherung Ihrer personenbezogenen Daten haben (z. B. steuer- oder handelsrechtliche Aufbewahrungsfristen); im letztgenannten Fall erfolgt die Löschung nach Fortfall dieser Gründe.",
    "legal_basis_title": "Allgemeine Hinweise zu den Rechtsgrundlagen der Datenverarbeitung auf dieser Website",
    "legal_basis_text": "Sofern Sie in die Datenverarbeitung eingewilligt haben, verarbeiten wir Ihre personenbezogenen Daten auf Grundlage von Art. 6 Abs. 1 lit. a DSGVO bzw. Art. 9 Abs. 2 lit. a DSGVO, sofern besondere Datenkategorien nach Art. 9 Abs. 1 DSGVO verarbeitet werden. Im Falle einer ausdrücklichen Einwilligung in die Übertragung personenbezogener Daten in Drittstaaten erfolgt die Datenverarbeitung außerdem auf Grundlage von Art. 49 Abs. 1 lit. a DSGVO. Sofern Sie in die Speicherung von Cookies oder in den Zugriff auf Informationen in Ihr Endgerät (z. B. via Device-Fingerprinting) eingewilligt haben, erfolgt die Datenverarbeitung zusätzlich auf Grundlage von § 25 Abs. 1 TDDDG. Die Einwilligung ist jederzeit widerrufbar. Sind Ihre Daten zur Vertragserfüllung oder zur Durchführung vorvertraglicher Maßnahmen erforderlich, verarbeiten wir Ihre Daten auf Grundlage des Art. 6 Abs. 1 lit. b DSGVO. Des Weiteren verarbeiten wir Ihre Daten, sofern diese zur Erfüllung einer rechtlichen Verpflichtung erforderlich sind auf Grundlage von Art. 6 Abs. 1 lit. c DSGVO. Die Datenverarbeitung kann ferner auf Grundlage unseres berechtigten Interesses nach Art. 6 Abs. 1 lit. f DSGVO erfolgen. Über die jeweils im Einzelfall einschlägigen Rechtsgrundlagen wird in den folgenden Absätzen dieser Datenschutzerklärung informiert.",
    "revocation_title": "Widerruf Ihrer Einwilligung zur Datenverarbeitung",
    "revocation_text": "Viele Datenverarbeitungsvorgänge sind nur mit Ihrer ausdrücklichen Einwilligung möglich. Sie können eine bereits erteilte Einwilligung jederzeit widerrufen. Die Rechtmäßigkeit der bis zum Widerruf erfolgten Datenverarbeitung bleibt vom Widerruf unberührt.",
    "objection_right_title": "Widerspruchsrecht gegen die Datenerhebung in besonderen Fällen sowie gegen Direktwerbung (Art. 21 DSGVO)",
    "objection_right_text_1": "WENN DIE DATENVERARBEITUNG AUF GRUNDLAGE VON ART. 6 ABS. 1 LIT. E ODER F DSGVO ERFOLGT, HABEN SIE JEDERZEIT DAS RECHT, AUS GRÜNDEN, DIE SICH AUS IHRER BESONDEREN SITUATION ERGEBEN, GEGEN DIE VERARBEITUNG IHRER PERSONENBEZOGENEN DATEN WIDERSPRUCH EINZULEGEN; DIES GILT AUCH FÜR EIN AUF DIESE BESTIMMUNGEN GESTÜTZTES PROFILING. DIE JEWEILIGE RECHTSGRUNDLAGE, AUF DENEN EINE VERARBEITUNG BERUHT, ENTNEHMEN SIE DIESER DATENSCHUTZERKLÄRUNG. WENN SIE WIDERSPRUCH EINLEGEN, WERDEN WIR IHRE BETROFFENEN PERSONENBEZOGENEN DATEN NICHT MEHR VERARBEITEN, ES SEI DENN, WIR KÖNNEN ZWINGENDE SCHUTZWÜRDIGE GRÜNDE FÜR DIE VERARBEITUNG NACHWEISEN, DIE IHRE INTERESSEN, RECHTE UND FREIHEITEN ÜBERWIEGEN ODER DIE VERARBEITUNG DIENT DER GELTENDMACHUNG, AUSÜBUNG ODER VERTEIDIGUNG VON RECHTSANSPRÜCHEN (WIDERSPRUCH NACH ART. 21 ABS. 1 DSGVO).",
    "objection_right_text_2": "WERDEN IHRE PERSONENBEZOGENEN DATEN VERARBEITET, UM DIREKTWERBUNG ZU BETREIBEN, SO HABEN SIE DAS RECHT, JEDERZEIT WIDERSPRUCH GEGEN DIE VERARBEITUNG SIE BETREFFENDER PERSONENBEZOGENER DATEN ZUM ZWECKE DERARTIGER WERBUNG EINZULEGEN; DIES GILT AUCH FÜR DAS PROFILING, SOWEIT ES MIT SOLCHER DIREKTWERBUNG IN VERBINDUNG STEHT. WENN SIE WIDERSPRECHEN, WERDEN IHRE PERSONENBEZOGENEN DATEN ANSCHLIESSEND NICHT MEHR ZUM ZWECKE DER DIREKTWERBUNG VERWENDET (WIDERSPRUCH NACH ART. 21 ABS. 2 DSGVO).",
    "complaint_right_title": "Beschwerderecht bei der zuständigen Aufsichtsbehörde",
    "complaint_right_text": "Im Falle von Verstößen gegen die DSGVO steht den Betroffenen ein Beschwerderecht bei einer Aufsichtsbehörde, insbesondere in dem Mitgliedstaat ihres gewöhnlichen Aufenthalts, ihres Arbeitsplatzes oder des Orts des mutmaßlichen Verstoßes zu. Das Beschwerderecht besteht unbeschadet anderweitiger verwaltungsrechtlicher oder gerichtlicher Rechtsbehelfe.",
    "data_portability_right_title": "Recht auf Datenübertragbarkeit",
    "data_portability_right_text": "Sie haben das Recht, Daten, die wir auf Grundlage Ihrer Einwilligung oder in Erfüllung eines Vertrags automatisiert verarbeiten, an sich oder an einen Dritten in einem gängigen, maschinenlesbaren Format aushändigen zu lassen. Sofern Sie die direkte Übertragung der Daten an einen anderen Verantwortlichen verlangen, erfolgt dies nur, soweit es technisch machbar ist.",
    "information_correction_deletion_title": "Auskunft, Berichtigung und Löschung",
    "information_correction_deletion_text": "Sie haben im Rahmen der geltenden gesetzlichen Bestimmungen jederzeit das Recht auf unentgeltliche Auskunft über Ihre gespeicherten personenbezogenen Daten, deren Herkunft und Empfänger und den Zweck der Datenverarbeitung und ggf. ein Recht auf Berichtigung oder Löschung dieser Daten. Hierzu sowie zu weiteren Fragen zum Thema personenbezogene Daten können Sie sich jederzeit an uns wenden.",
    "processing_restriction_right_title": "Recht auf Einschränkung der Verarbeitung",
    "processing_restriction_right_text_1": "Sie haben das Recht, die Einschränkung der Verarbeitung Ihrer personenbezogenen Daten zu verlangen. Hierzu können Sie sich jederzeit an uns wenden. Das Recht auf Einschränkung der Verarbeitung besteht in folgenden Fällen:",
    "processing_restriction_right_list": {
      "0": "Wenn Sie die Richtigkeit Ihrer bei uns gespeicherten personenbezogenen Daten bestreiten, benötigen wir in der Regel Zeit, um dies zu überprüfen. Für die Dauer der Prüfung haben Sie das Recht, die Einschränkung der Verarbeitung Ihrer personenbezogenen Daten zu verlangen.",
      "1": "Wenn die Verarbeitung Ihrer personenbezogenen Daten unrechtmäßig geschah/geschieht, können Sie statt der Löschung die Einschränkung der Datenverarbeitung verlangen.",
      "2": "Wenn wir Ihre personenbezogenen Daten nicht mehr benötigen, Sie sie jedoch zur Ausübung, Verteidigung oder Geltendmachung von Rechtsansprüchen benötigen, haben Sie das Recht, statt der Löschung die Einschränkung der Verarbeitung Ihrer personenbezogenen Daten zu verlangen.",
      "3": "Wenn Sie einen Widerspruch nach Art. 21 Abs. 1 DSGVO eingelegt haben, muss eine Abwägung zwischen Ihren und unseren Interessen vorgenommen werden. Solange noch nicht feststeht, wessen Interessen überwiegen, haben Sie das Recht, die Einschränkung der Verarbeitung Ihrer personenbezogenen Daten zu verlangen."
    },
    "processing_restriction_right_text_2": "Wenn Sie die Verarbeitung Ihrer personenbezogenen Daten eingeschränkt haben, dürfen diese Daten - von ihrer Speicherung abgesehen - nur mit Ihrer Einwilligung oder zur Geltendmachung, Ausübung oder Verteidigung von Rechtsansprüchen oder zum Schutz der Rechte einer anderen natürlichen oder juristischen Person oder aus Gründen eines wichtigen öffentlichen Interesses der Europäischen Union oder eines Mitgliedstaats verarbeitet werden.",
    "ssl_tls_encryption_title": "SSL- bzw. TLS-Verschlüsselung",
    "ssl_tls_encryption_text": "Diese Seite nutzt aus Sicherheitsgründen und zum Schutz der Übertragung vertraulicher Inhalte, wie zum Beispiel Bestellungen oder Anfragen, die Sie an uns als Seitenbetreiber senden, eine SSL- bzw. TLS-Verschlüsselung. Eine verschlüsselte Verbindung erkennen Sie daran, dass die Adresszeile des Browsers von „http://“ auf „https://“ wechselt und an dem Schloss-Symbol in Ihrer Browserzeile. Wenn die SSL- bzw. TLS-Verschlüsselung aktiviert ist, können die Daten, die Sie an uns übermitteln, nicht von Dritten mitgelesen werden."
  },
  "terms_of_service": {
    "last_updated": "Zuletzt aktualisiert: 13. August 2025",
    "title": "Nutzungsbedingungen von Swim Gen",
    "intro": "Diese Bedingungen regeln die Nutzung dieser Anwendung sowie alle damit verbundenen Vereinbarungen oder Rechtsverhältnisse mit dem Betreiber in rechtlich verbindlicher Weise. Großgeschriebene Begriffe sind im entsprechenden Abschnitt dieses Dokuments definiert.",
    "read_carefully": "Bitte lesen Sie dieses Dokument sorgfältig.",
    "provided_by": "Diese Anwendung wird bereitgestellt von:",
    "owner": "Swim Gen",
    "owner_contact": "Kontakt E-Mail des Betreibers: {mail}",
    "at_a_glance_title": "Wichtige Hinweise auf einen Blick",
    "at_a_glance": "Bitte beachten Sie, dass einige Bestimmungen dieser Bedingungen nur für bestimmte Nutzergruppen gelten. Insbesondere können einzelne Klauseln nur für Verbraucher oder für Nutzer gelten, die nicht als Verbraucher eingestuft werden. Solche Einschränkungen werden immer ausdrücklich in der jeweiligen Klausel erwähnt. Fehlt ein solcher Hinweis, gelten die Klauseln für alle Nutzer.",
    "terms_of_use_title": "NUTZUNGSREGELN",
    "terms_of_use": "Sofern nicht anders angegeben, gelten die in diesem Abschnitt beschriebenen Nutzungsregeln allgemein für die Nutzung dieser Anwendung.",
    "additional_conditions": "In bestimmten Fällen können zusätzliche Nutzungs- oder Zugangsbedingungen gelten, die in diesem Dokument gesondert aufgeführt werden.",
    "requirements": "Mit der Nutzung dieser Anwendung bestätigen Sie, dass Sie folgende Voraussetzungen erfüllen:",
    "requirements_list": {
      "0": "Es bestehen keine Einschränkungen hinsichtlich der Nutzung als Verbraucher oder gewerblicher Nutzer."
    },
    "content_title": "Inhalte dieser Anwendung",
    "content": "Sofern nicht anders angegeben oder klar erkennbar, sind alle auf dieser Anwendung verfügbaren Inhalte Eigentum des Betreibers oder werden von diesem lizenziert.",
    "content_effort": "Der Betreiber bemüht sich nach besten Kräften, sicherzustellen, dass die bereitgestellten Inhalte keine geltenden Gesetze oder Rechte Dritter verletzen. Dennoch kann dies nicht immer garantiert werden. In solchen Fällen - unbeschadet gesetzlicher Rechte der Nutzer - bitten wir um Mitteilung über die im Dokument angegebenen Kontaktdaten.",
    "rights_title": "Rechte an Inhalten dieser Anwendung - Alle Rechte vorbehalten",
    "rights": "Der Betreiber hält und behält sich alle Rechte an geistigem Eigentum an diesen Inhalten vor.",
    "rights_usage": "Nutzer dürfen diese Inhalte nur im Rahmen der ordnungsgemäßen Nutzung des Dienstes verwenden.",
    "rights_prohibited": "Insbesondere - aber nicht ausschließlich - ist es Nutzern untersagt, Inhalte zu kopieren, herunterzuladen, zu teilen (außer im unten genannten Rahmen), zu verändern, zu übersetzen, zu veröffentlichen, zu übertragen, zu verkaufen, zu unterlizenzieren, zu bearbeiten, an Dritte weiterzugeben oder abgeleitete Werke daraus zu erstellen, noch Dritten dies über das eigene Gerät zu ermöglichen - auch nicht unwissentlich.",
    "rights_personal_use": "Sofern ausdrücklich angegeben, dürfen Nutzer bestimmte Inhalte für den rein persönlichen und nicht-kommerziellen Gebrauch herunterladen, kopieren und/oder teilen, sofern alle Urheberrechts- und sonstigen Hinweise des Betreibers korrekt übernommen werden.",
    "rights_limitation": "Gesetzliche Schranken und Ausnahmen des Urheberrechts bleiben unberührt.",
    "user_content_title": "Von Nutzern bereitgestellte Inhalte",
    "user_content": "Der Betreiber ermöglicht es Nutzern, Inhalte bereitzustellen - insbesondere zur Spende von Trainingsplänen zur Verbesserung des Dienstes.",
    "user_content_confirm": "Mit der Bereitstellung von Inhalten bestätigen Nutzer, hierzu rechtlich befugt zu sein und keine gesetzlichen Bestimmungen oder Rechte Dritter zu verletzen.",
    "external_resources_title": "Zugriff auf externe Ressourcen",
    "external_resources": "Über diese Anwendung können Nutzer auf externe Ressourcen Dritter zugreifen. Nutzer erkennen an, dass der Betreiber keinen Einfluss auf diese Ressourcen hat und daher nicht für deren Inhalte oder Verfügbarkeit haftet.",
    "external_resources_conditions": "Für externe Ressourcen gelten die jeweiligen Nutzungsbedingungen der Drittanbieter oder - falls nicht vorhanden - die gesetzlichen Bestimmungen.",
    "acceptable_use_title": "Zulässige Nutzung",
    "acceptable_use": "Diese Anwendung und der Dienst dürfen nur im Rahmen des vorgesehenen Zwecks, dieser Bedingungen und geltender Gesetze genutzt werden.",
    "acceptable_use_responsibility": "Nutzer sind allein dafür verantwortlich, dass ihre Nutzung dieser Anwendung und/oder des Dienstes keine Gesetze, Vorschriften oder Rechte Dritter verletzt.",
    "acceptable_use_rights": "Der Betreiber behält sich das Recht vor, zum Schutz seiner berechtigten Interessen geeignete Maßnahmen zu ergreifen - z. B. den Zugang zur Anwendung oder zum Dienst zu verweigern, Verträge zu kündigen oder Verstöße an die zuständigen Behörden zu melden -, wenn Nutzer eine der folgenden Handlungen begehen oder im Verdacht stehen:",
    "acceptable_use_list": {
      "0": "Verstoß gegen Gesetze, Vorschriften und/oder diese Bedingungen;",
      "1": "Verletzung von Rechten Dritter;",
      "2": "erhebliche Beeinträchtigung berechtigter Interessen des Betreibers;",
      "3": "Beleidigung des Betreibers oder Dritter."
    },
    "privacy_policy_title": "Datenschutzerklärung",
    "privacy_policy": "Weitere Informationen zur Verwendung personenbezogener Daten finden Nutzer in der Datenschutzerklärung dieser Anwendung.",
    "ip_rights_title": "Rechte an geistigem Eigentum",
    "ip_rights": "Soweit in diesen Bedingungen nicht anders geregelt, sind sämtliche Rechte an geistigem Eigentum (z. B. Urheberrechte, Markenrechte, Patente, Designrechte) an dieser Anwendung ausschließliches Eigentum des Betreibers oder seiner Lizenzgeber und durch geltende Gesetze und internationale Abkommen geschützt.",
    "ip_rights_trademarks": "Alle Marken - ob bildlich oder wortlich - sowie sonstige Kennzeichen, Handelsnamen, Dienstleistungsmarken, Wortmarken, Illustrationen, Bilder oder Logos im Zusammenhang mit dieser Anwendung sind und bleiben ausschließliches Eigentum des Betreibers oder seiner Lizenzgeber und unterliegen dem Schutz durch geltende Gesetze und internationale Abkommen.",
    "changes_title": "Änderungen dieser Bedingungen",
    "changes": "Der Betreiber behält sich das Recht vor, diese Bedingungen jederzeit zu ändern oder zu ergänzen. In solchen Fällen werden die Nutzer entsprechend informiert.",
    "changes_effect": "Solche Änderungen wirken sich nur auf das zukünftige Vertragsverhältnis mit dem Nutzer aus.",
    "changes_acceptance": "Die fortgesetzte Nutzung des Dienstes gilt als Zustimmung zu den geänderten Bedingungen. Nutzer, die nicht an die Änderungen gebunden sein möchten, müssen die Nutzung einstellen. Die Nichtakzeptanz der neuen Bedingungen kann beiden Parteien das Recht zur Kündigung einräumen.",
    "changes_previous": "Für das Vertragsverhältnis vor Annahme der neuen Bedingungen gilt die vorherige Version. Diese kann beim Betreiber angefordert werden.",
    "changes_law": "Soweit gesetzlich erforderlich, gibt der Betreiber das Inkrafttreten der geänderten Bedingungen bekannt.",
    "assignment_title": "Vertragsübertragung",
    "assignment": "Der Betreiber ist berechtigt, Rechte und Pflichten aus diesen Bedingungen ganz oder teilweise auf Dritte zu übertragen, sofern berechtigte Interessen des Nutzers gewahrt bleiben. Für Änderungen dieser Bedingungen gelten die entsprechenden Regelungen.",
    "assignment_user": "Nutzer dürfen ihre Rechte und Pflichten aus diesen Bedingungen nur mit schriftlicher Zustimmung des Betreibers übertragen.",
    "contacts_title": "Kontakt",
    "contacts": "Sämtliche Mitteilungen im Zusammenhang mit der Nutzung dieser Anwendung sind an die im Dokument angegebenen Kontaktdaten zu richten.",
    "severability_title": "Salvatorische Klausel",
    "severability": "Sollte eine Bestimmung dieser Bedingungen ganz oder teilweise unwirksam oder undurchsetzbar sein, bleibt die Wirksamkeit der übrigen Bestimmungen unberührt.",
    "governing_law_title": "Anwendbares Recht",
    "governing_law": "Diese Bedingungen unterliegen dem Recht am Sitz des Betreibers, wie im entsprechenden Abschnitt dieses Dokuments angegeben, unter Ausschluss kollisionsrechtlicher Vorschriften.",
    "venue_title": "Gerichtsstand",
    "venue": "Für alle Streitigkeiten aus oder im Zusammenhang mit diesen Bedingungen ist ausschließlich das Gericht am Sitz des Betreibers zuständig, wie im entsprechenden Abschnitt dieses Dokuments angegeben.",
    "dispute_title": "Streitbeilegung",
    "amicable_title": "Einvernehmliche Streitbeilegung",
    "amicable": "Nutzer können Streitigkeiten an den Betreiber herantragen, der sich um eine einvernehmliche Lösung bemüht.",
    "amicable_right": "Das Recht der Nutzer, gerichtliche Schritte einzuleiten, bleibt stets unberührt. Bei Streitigkeiten im Zusammenhang mit der Nutzung dieser Anwendung oder des Dienstes werden Nutzer gebeten, den Betreiber über die angegebenen Kontaktdaten zu kontaktieren.",
    "amicable_complaint": "Nutzer können Beschwerden mit einer kurzen Beschreibung und ggf. Angaben zur Bestellung, zum Kauf oder zum Konto an die im Dokument angegebene E-Mail-Adresse des Betreibers senden.",
    "amicable_process": "Der Betreiber bearbeitet Beschwerden unverzüglich und innerhalb von 21 Tagen nach Eingang."
  },
  "errors": {
    "unknown_error": "Ein unbekannter Fehler ist aufgetreten. Bitte versuche es später erneut.",
    "health_check_failed": "Der Systemcheck ist fehlgeschlagen. Bitte versuche es später erneut.",
    "training_plan_failed": "Der Trainingsplan konnte nicht generiert werden. Bitte überprüfen deine Eingaben und versuche es erneut.",
    "failed_to_generate_prompt": "Prompt konnte nicht generiert werden",
    "failed_to_generate_plan": "Plan konnte nicht generiert werden",
    "failed_to_export_plan": "Trainingsplan konnte nicht als PDF exportiert werden.",
    "timeout": "Die Anfrage wurde nach {time} Sekunden abgebrochen. Bitte versuche es erneut.",
    "connection_failed": "Verbindung zum Server fehlgeschlagen. Bitte überprüfe deine Internetverbindung und versuche es erneut.",
    "api_request_failed": "API-Anfrage für {endpoint} fehlgeschlagen",
    "upsert_failed": "Trainingsplan konnte nicht aktualisiert werden"
  },
  "login": {
    "login": "Anmelden",
    "logout": "Abmelden",
    "signUp": "Registrieren",
    "email": "E-Mail",
    "password": "Passwort",
    "username": "Benutzername",
    "loading": "Lädt...",
    "needAccount": "Neu bei Swim Gen? Registriere dich hier",
    "haveAccount": "Hast du bereits ein Konto? Melde dich hier an",
    "checkEmail": "Überprüfe deine E-Mails für den Anmelde-Link!",
    "invalidLogin": "Ungültige Anmeldeinformationen. Bitte versuche es erneut.",
    "emailNotConfirmed": "E-Mail nicht bestätigt. Bitte überprüfe deine E-Mails.",
    "registrationFailed": "Die Registrierung ist fehlgeschlagen. Bitte versuche es erneut.",
    "loginSuccess": "Anmeldung erfolgreich!",
    "registrationSuccess": "Registrierung erfolgreich! Bitte überprüfe deine E-Mails, um dein Konto zu bestätigen.",
    "usernameTaken": "Der Benutzername ist bereits vergeben. Bitte wähle einen anderen.",
    "userExistsLoginSuccess": "Benutzer existiert bereits, Anmeldung erfolgreich!",
    "userExistsLoginFailed": "Benutzer existiert bereits, aber die Anmeldung ist fehlgeschlagen. Bitte überprüfe deine Anmeldeinformationen.",
    "unknownError": "Ein unbekannter Fehler ist aufgetreten. Bitte kontaktiere den Support.",
    "logoutSuccess": "Abmeldung erfolgreich!",
    "logoutFailed": "Die Abmeldung ist fehlgeschlagen. Bitte versuche es erneut."
  },
  "profile": {
    "title": "Profil",
    "description": "Hallo, {user}. Hier kannst du deine Informationen anzeigen und bearbeiten sowie Statistiken zu deinen generierten Trainingsplänen einsehen.",
    "your_information": "Deine Informationen",
    "info_description": "Diese Profilinformationen werden verwendet, um die Generierung von Plänen zu verbessern. Sie sind auch für andere Nutzer sichtbar.",
    "experience": "Erfahrung",
    "experience_explanation": "Dein Erfahrungslevel im Schwimmen.",
    "preferred_strokes": "Bevorzugte Schwimmstile",
    "preferred_strokes_explanation": "Deine bevorzugten Schwimmstile.",
    "categories": "Kategorien",
    "categories_explanation": "Deine Benutzerkategorien.",
    "edit_profile": "Profil bearbeiten",
    "save": "Speichern",
    "saving": "Speichert...",
    "generated_plans": "Generierte Pläne",
    "generated_plans_tooltip": "Die Gesamtanzahl der Trainingspläne, die du in Swim Gen generiert hast.",
    "exported_plans": "Exportierte Pläne",
    "exported_plans_tooltip": "Die Gesamtanzahl der Trainingspläne, die du als PDF exportiert hast.",
    "monthly_quota": "Monatliches Kontingent",
    "monthly_quota_tooltip": "Die Anzahl der erweiterten Trainingsgenerierungen, die du diesen Monat durchgeführt hast. Erweitertes Generieren umfasst alle Trainingspläne, die im Chat Modus oder in Multi-Plan Anfragen generiert wurden. Das Kontigent wird am ersten Tag jedes Monats zurückgesetzt.",
    "delete_account": "Konto löschen",
    "delete_account_placeholder": "Diese Aktion kann nicht rückgängig gemacht werden.",
    "delete_account_button": "Konto löschen",
    "experience_beginner": "Anfänger",
    "experience_advanced": "Fortgeschritten",
    "experience_competitive": "Leistungsschwimmer",
    "category_triathlete": "Triathlet",
    "category_swimmer": "Schwimmer",
    "category_coach": "Trainer",
    "category_hobby": "Hobbyschwimmer",
    "no_selection_placeholder": "Noch keine Auswahl",
    "freestyle": "Freistil",
    "breaststroke": "Brustschwimmen",
    "backstroke": "Rückenschwimmen",
    "butterfly": "Schmetterling",
    "individual_medley": "Lagen"
  },
  "sidebar": {
    "history": "Deine Pläne",
    "generated": "Generierte Pläne",
    "generated_placeholder": "Noch keine Pläne generiert.",
    "uploaded": "Hochgeladene Pläne",
    "uploaded_placeholder": "Noch keine Pläne hochgeladen.",
    "shared": "Mit Dir Geteilte Pläne",
    "shared_placeholder": "Noch keine Pläne mit dir geteilt.",
    "create_new": "Neuen Plan erstellen",
    "upload_plan": "Plan hochladen"
  },
  "donation": {
    "title": "Trainingsplan spenden",
    "intro": "Teile deinen Trainingsplan mit der Community! Bitte fülle die untenstehenden Details aus.",
    "submit": "Plan speichern",
    "loading": "Lade plan hoch...",
    "success_toast": "Plan erfolgreich gespeichert!",
    "error_toast": "Plan konnte nicht gespeichert werden: {error}",
    "no_plan_toast": "Der gespeicherte Plan konnte nicht gefunden werden.\n{error}",
    "newPlan": {
      "title": "Neuer Plan",
      "description": "Keine Beschreibung angegeben.",
      "warmup": "Einschwimmen",
      "total": "Gesamt"
    },
    "title_required": "Bitte gib einen Titel für deinen Plan an.",
    "upload_image_btn": "Bild hochladen & Plan extrahieren",
    "processing_image": "Verarbeite Bild...",
    "upload_image_hint": "Lade ein Bild eines Schwimmplans hoch, um ihn automatisch zu extrahieren.",
    "image_upload_success": "Plan erfolgreich extrahiert!",
    "image_upload_error": "Plan konnte nicht aus dem Bild extrahiert werden.",
    "view": {
      "title": "Dein hochgeladener Plan",
      "description": "Dieser Plan wurde von dir hochgeladen. Du kannst ihn editieren, teilen oder exportieren. Andernfalls kannst du dir Variationen dieses Plans mittels der interaktiven Bearbeitung erstellen."
    }
  },
  "labels": {
    "created_at": "Erstellt am",
    "updated_at": "Aktualisiert",
    "exported_at": "Exportiert"
  },
  "share": {
    "fetching_url": "Generiere Freigabe-Link...",
    "copy": "Link kopieren",
    "copied": "Kopiert!",
    "show_url": "Teile diesen Link, um mit anderen diesen Trainingsplan zu teilen:",
    "share_plan": "Plan teilen"
  },
  "interaction": {
    "save_to_history": "In \"Deine Pläne\" speichern",
    "snapshot_saved": "Snapshot in \"Deine Pläne\" gespeichert!",
    "not_found": "Plan nicht gefunden.",
    "no_messages": "Noch keine Nachrichten in dieser Konversation.",
    "you": "Du",
    "ai": "Swim Gen",
    "conversation_tab": "Interaktive Bearbeitung",
    "plan_tab": "Trainingsplan",
    "show_plan": "Plan anzeigen",
    "hide_plan": "Plan ausblenden",
    "give_feedback": "Feedback geben",
    "metadata": "Metadaten",
    "created_at": "Erstellt am",
    "updated_at": "Aktualisiert am",
    "chat_placeholder": "Nachricht eingeben...",
    "describe_changes": "Beschreibe hier deine gewünschte Änderung"
  },
  "shared": {
    "loading": "Lade geteilten Trainingsplan...",
    "hero_title": "Geteilter Trainingsplan",
    "hero_description_one": "Du siehst einen Trainingsplan, der von ",
    "hero_description_two": " geteilt wurde.\nDu kannst diesen Plan bearbeiten, für die Nutzung am Becken exportieren oder basierend auf deinen eigenen Anforderungen einen Neuen generieren. Änderungen werden in deiner Historie gespeichert und nicht zurück an {username} gesendet.",
    "no_plan_toast": "Der Plan konnte nicht gefunden werden.\n{error}",
    "register_to_save": "Melde dich an, um diesen Plan zu speichern und zu bearbeiten!",
    "unknown_user": "Unbekannter Nutzer",
    "start_conversation": "Interaktives Bearbeiten"
  },
  "feedback": {
    "title": "Wie war dein Training?",
    "subtitle": "Feedback für: {plan}",
    "thank_you": "Vielen Dank, dass du dir die Zeit nimmst, uns dein Feedback zu geben. Deine Rückmeldung hilft uns, die Trainingspläne für alle zu verbessern!",
    "rating_label": "Gesamtbewertung",
    "swam_label": "Ich bin diesen Plan geschwommen",
    "difficulty_label": "Schwierigkeit",
    "easy": "Leicht",
    "hard": "Schwer",
    "comment_label": "Kommentar",
    "comment_placeholder": "Was hat dir gefallen? Was könnte besser sein?",
    "disclaimer": "Dein Feedback wird genutzt um Swim Gen zu verbessern.",
    "submit_success": "Danke für dein Feedback!"
  },
  "common": {
    "submit": "Absenden",
    "loading": "Lade...",
    "optional": "optional"
  }
}
