{
  "app": {
    "name": "Swim Gen",
    "slogan": "AI-powered training plan generator for swimmers and triathletes.",
    "hero_title": "AI-Powered Swimming Training Plans",
    "hero_description": "Generate personalized training plans for swimmers, triathletes, and coaches. Just describe what you're looking for, and our system will create a custom training for you."
  },
  "home": {
    "banner": {
      "not_logged_in": {
        "text": "If you want to save a future plan or use interactive editing create an account or log in.",
        "button": "Login"
      },
      "logged_in": {
        "text": "To view this plan in your history and use interactive editing click here:",
        "button": "Interactive Editing"
      }
    }
  },
  "header": {
    "home": "Home",
    "about": "About",
    "profile": "Profile"
  },
  "footer": {
    "privacy_legal": "Privacy & Legal",
    "privacy_policy": "Privacy Policy",
    "terms_of_service": "Terms of Service",
    "impressum": "Impressum",
    "about": "About",
    "contact": "Contact",
    "github": "GitHub",
    "roadmap": "Roadmap",
    "sponsor": "Support this Project",
    "copyright": "© 2025 Swim Gen. Built with Vue.js and TypeScript."
  },
  "form": {
    "describe_training_needs": "Describe your training needs",
    "describe_training_needs_tooltip": "Write a request in your preferred language. Try to be specific about your goals, experience level, time constraints, and preferences.",
    "example_placeholder": "Example: I need a 45-minute freestyle endurance workout for an intermediate swimmer...",
    "show_advanced_settings": "Show Advanced Settings",
    "hide_advanced_settings": "Hide Advanced Settings",
    "i_feel_lucky": "I feel lucky",
    "generating": "Generating...",
    "swimming_strokes": "Swimming Strokes",
    "swimming_strokes_tooltip": "Select specific swimming strokes to explicitly include.",
    "freestyle": "Freestyle",
    "breaststroke": "Breaststroke",
    "backstroke": "Backstroke",
    "butterfly": "Butterfly",
    "individual_medley": "Individual Medley",
    "difficulty_level": "Difficulty Level",
    "difficulty_non_swimmer": "Non-swimmer",
    "difficulty_beginner": "Beginner",
    "difficulty_advanced": "Advanced",
    "difficulty_competitive_swimmer": "Competitive Swimmer",
    "difficulty_elite_athlete": "Elite Athlete",
    "difficulty_level_tooltip": "Filter plans by swimmer experience level",
    "any_difficulty": "Any difficulty",
    "training_type": "Training Type",
    "training_type_tooltip": "Filter plans by training focus and goals",
    "any_training_type": "Any training type",
    "training_type_technique_training": "Technique Training",
    "training_type_performance_test": "Performance Test",
    "training_type_base_endurance": "Base Endurance",
    "training_type_recovery": "Recovery",
    "training_type_sprint": "Sprint",
    "training_type_distance": "Distance",
    "training_type_breath_control": "Breath Control",
    "training_type_race_preparation": "Race Preparation",
    "clear_all_filters": "Clear All Filters",
    "generate_training_plan": "Generate Training Plan",
    "generating_plan": "Generating...",
    "request_too_long": "Your request is too long! Please limit it to 3000 characters.",
    "pool_length": "Pool Length",
    "pool_length_tooltip": "The pool length is used to refine the training plan. 25m is the default.",
    "pool_length_twenty_five_meters": "25 meters",
    "pool_length_fifty_meters": "50 meters",
    "pool_length_open_water": "Open water",
    "use_profile_preferences": "Use Profile Preferences",
    "use_profile_preferences_tooltip": "Incorporate your profile settings (experience, strokes, categories) into the plan generation."
  },
  "display": {
    "generating_plan_message": "Generating your training plan...",
    "plan_title": "No title provided.",
    "plan_description": "No description provided.",
    "amount": "Amount",
    "amount_tooltip": "Number of repetitions for the exercise.",
    "distance": "Distance (m)",
    "distance_tooltip": "Distance in meters for each repetition.",
    "break": "Break",
    "break_tooltip": "Rest period between repetitions or sets.",
    "content": "Content",
    "content_tooltip": {
      "title": "Common abbreviations for swimming strokes and techniques:",
      "freestyle": "K, Kr, Freistil, F, Fr: Kraulschwimmen (Freestyle)",
      "backstroke": "R: Rückenschwimmen (Backstroke)",
      "breaststroke": "B, Br: Brustschwimmen (Breaststroke)",
      "leg_work": "Be: Beinarbeit (Leg work)",
      "butterfly": "S, D: Schmetterling/Delfinschwimmen (Butterfly)",
      "individual_medley": "Lagen: Lagenstaffel (Individual Medley)"
    },
    "intensity": "Intensity",
    "intensity_tooltip": {
      "title": "Common swimming intensity abbreviations:",
      "ga": "GA: Basic Endurance - categorized as:",
      "ga1": "GA1: Normal intensity, equivalent to BZ 2",
      "ga1_2": "GA1-2: Slightly increased intensity, BZ 3",
      "ga2": "GA2: Brisk intensity, equivalent to BZ 4/5",
      "lza": "LZA: Long-duration endurance - long, rather low to moderate intensity sessions for building the endurance base",
      "hf": "HF: Heart Rate - used to control intensity and training zones",
      "lt": "LT: Lactate Threshold - intensity at which lactate rises noticeably",
      "sa": "SA: Speed endurance - high intensities over middle distances",
      "ta": "TA: Technique endurance",
      "tue": "T / TÜ: Technical drill",
      "ts": "TS: Technically clean",
      "sprint": "S: Sprint, equivalent to BZ 8",
      "recovery": "ReKom: Recovery, BZ 1"
    },
    "total": "Total (m)",
    "total_tooltip": "Total distance in meters for the exercise set.",
    "meters_total": "Meters Total",
    "exercise_sets": "Exercise Sets",
    "no_plan_placeholder": "No training plan generated yet. Use the form above to create one!",
    "done_editing": "Done Editing",
    "refine_plan": "Refine Plan",
    "export_pdf": "Export PDF",
    "exporting": "Exporting...",
    "open_pdf": "Open PDF",
    "export_horizontal": "Horizontal",
    "export_large_font": "Large Font",
    "add_row": "Add new row",
    "remove_row": "Remove this row",
    "move_row_up": "Move row up",
    "move_row_down": "Move row down"
  },
  "impressum": {
    "title": "Impressum",
    "contact_title": "Contact",
    "phone": "Phone",
    "email": "Email"
  },
  "privacy_policy": {
    "title": "Privacy Policy",
    "last_updated": "Last Updated: August 30, 2025",
    "data_protection_at_a_glance_title": "1. Data Protection at a Glance",
    "general_notes_title": "General Information",
    "general_notes_text": "The following notes provide a simple overview of what happens to your personal data when you visit this website. Personal data is any data with which you could be personally identified. Detailed information on the subject of data protection can be found in our privacy policy listed below this text.",
    "data_collection_on_this_website_title": "Data Collection on this Website",
    "who_is_responsible_title": "Who is responsible for data collection on this website?",
    "who_is_responsible_text": "The data processing on this website is carried out by the website operator. Their contact details can be found in the 'Information on the responsible party' section of this privacy policy.",
    "how_we_collect_data_title": "How do we collect your data?",
    "how_we_collect_data_text": "We do not collect personal data automatically. The only data we process is that which you explicitly provide to us, for example, by entering training requirements into the plan generation form. This data is used exclusively for creating the training plan and is not stored.",
    "what_we_use_data_for_title": "What do we use your data for?",
    "what_we_use_data_for_text": "The data you provide is used exclusively to provide the services the site offers to the user. Your requests and the generated plans are not stored. Exported plans are temporarly stored to enable downloading. We do not use data to analyze user behavior.",
    "your_rights_title": "What are your rights regarding your data?",
    "your_rights_text": "You have the right at any time to receive information free of charge about the origin, recipient, and purpose of your stored personal data. You also have a right to request that this data be corrected or deleted. If you have given your consent to data processing, you may revoke this consent at any time for the future. You also have the right, under certain circumstances, to request the restriction of the processing of your personal data. Furthermore, you have the right to lodge a complaint with the competent supervisory authority. You can contact us at any time for further questions on the subject of data protection.",
    "general_and_mandatory_info_title": "2. General and Mandatory Information",
    "data_protection_title": "Data Protection",
    "data_protection_text": "The operators of these pages take the protection of your personal data very seriously. We treat your personal data as confidential and in accordance with the statutory data protection regulations and this privacy policy. When you use this website, various personal data are collected. Personal data is any data with which you could be personally identified. This privacy policy explains what data we collect and what we use it for. It also explains how and for what purpose this happens. We would like to point out that data transmission over the Internet (e.g., when communicating by e-mail) can have security gaps. A complete protection of the data from access by third parties is not possible.",
    "responsible_party_title": "Information on the responsible party",
    "responsible_party_text": "The responsible party for data processing on this website is:",
    "responsible_party_definition": "The responsible party is the natural or legal person who alone or jointly with others decides on the purposes and means of processing personal data (e.g., names, e-mail addresses, or the like).",
    "storage_duration_title": "Storage Duration",
    "storage_duration_text": "Unless a more specific storage period has been specified in this privacy policy, your personal data will remain with us until the purpose for which it was collected no longer applies. If you assert a justified request for deletion or revoke your consent to data processing, your data will be deleted, unless we have other legally permissible reasons for storing your personal data (e.g., tax or commercial law retention periods); in the latter case, the deletion will take place after these reasons cease to apply.",
    "legal_basis_title": "General information on the legal basis for data processing on this website",
    "legal_basis_text": "If you have consented to data processing, we process your personal data on the basis of Art. 6 (1) (a) GDPR or Art. 9 (2) (a) GDPR, if special categories of data are processed according to Art. 9 (1) GDPR. In the case of explicit consent to the transfer of personal data to third countries, data processing is also based on Art. 49 (1) (a) GDPR. If you have consented to the storage of cookies or to the access to information in your end device (e.g., via device fingerprinting), the data processing is additionally based on § 25 (1) TDDDG. The consent can be revoked at any time. If your data is required for the fulfillment of a contract or for the implementation of pre-contractual measures, we process your data on the basis of Art. 6 (1) (b) GDPR. Furthermore, we process your data if they are required for the fulfillment of a legal obligation on the basis of Art. 6 (1) (c) GDPR. The data processing may also be based on our legitimate interest according to Art. 6 (1) (f) GDPR. Information on the relevant legal basis in each individual case is provided in the following paragraphs of this privacy policy.",
    "revocation_title": "Revocation of your consent to data processing",
    "revocation_text": "Many data processing operations are only possible with your express consent. You can revoke consent you have already given at any time. The legality of the data processing carried out until the revocation remains unaffected by the revocation.",
    "objection_right_title": "Right to object to data collection in special cases and to direct marketing (Art. 21 GDPR)",
    "objection_right_text_1": "IF THE DATA PROCESSING IS BASED ON ART. 6 (1) (E) OR (F) GDPR, YOU HAVE THE RIGHT TO OBJECT TO THE PROCESSING OF YOUR PERSONAL DATA AT ANY TIME FOR REASONS ARISING FROM YOUR PARTICULAR SITUATION; THIS ALSO APPLIES TO PROFILING BASED ON THESE PROVISIONS. THE RESPECTIVE LEGAL BASIS ON WHICH PROCESSING IS BASED CAN BE FOUND IN THIS PRIVACY POLICY. IF YOU OBJECT, WE WILL NO LONGER PROCESS YOUR AFFECTED PERSONAL DATA UNLESS WE CAN DEMONSTRATE COMPELLING LEGITIMATE GROUNDS FOR THE PROCESSING WHICH OVERRIDE YOUR INTERESTS, RIGHTS AND FREEDOMS, OR THE PROCESSING SERVES THE ASSERTION, EXERCISE OR DEFENSE OF LEGAL CLAIMS (OBJECTION ACCORDING TO ART. 21 (1) GDPR).",
    "objection_right_text_2": "IF YOUR PERSONAL DATA ARE PROCESSED FOR DIRECT MARKETING PURPOSES, YOU HAVE THE RIGHT TO OBJECT AT ANY TIME TO THE PROCESSING OF PERSONAL DATA CONCERNING YOU FOR THE PURPOSE OF SUCH MARKETING; THIS ALSO APPLIES TO PROFILING TO THE EXTENT THAT IT IS RELATED TO SUCH DIRECT MARKETING. IF YOU OBJECT, YOUR PERSONAL DATA WILL SUBSEQUENTLY NO LONGER BE USED FOR THE PURPOSE OF DIRECT MARKETING (OBJECTION ACCORDING TO ART. 21 (2) GDPR).",
    "complaint_right_title": "Right to lodge a complaint with a supervisory authority",
    "complaint_right_text": "In the event of breaches of the GDPR, data subjects have a right to lodge a complaint with a supervisory authority, in particular in the Member State of their habitual residence, their place of work or the place of the alleged breach. The right to lodge a complaint is without prejudice to any other administrative or judicial remedy.",
    "data_portability_right_title": "Right to data portability",
    "data_portability_right_text": "You have the right to have data which we process automatically on the basis of your consent or in fulfillment of a contract handed over to yourself or to a third party in a common, machine-readable format. If you request the direct transfer of the data to another responsible party, this will only be done to the extent technically feasible.",
    "information_correction_deletion_title": "Information, correction and deletion",
    "information_correction_deletion_text": "Within the framework of the applicable legal provisions, you have the right at any time to free information about your stored personal data, its origin and recipient and the purpose of the data processing and, if applicable, a right to correction or deletion of this data. For this purpose, as well as for further questions on the subject of personal data, you can contact us at any time.",
    "processing_restriction_right_title": "Right to restriction of processing",
    "processing_restriction_right_text_1": "You have the right to request the restriction of the processing of your personal data. You can contact us at any time for this purpose. The right to restriction of processing exists in the following cases:",
    "processing_restriction_right_list": {
      "0": "If you dispute the accuracy of your personal data stored by us, we usually need time to verify this. For the duration of the verification, you have the right to request the restriction of the processing of your personal data.",
      "1": "If the processing of your personal data was/is unlawful, you can request the restriction of data processing instead of deletion.",
      "2": "If we no longer need your personal data, but you need it to exercise, defend or assert legal claims, you have the right to request the restriction of the processing of your personal data instead of deletion.",
      "3": "If you have lodged an objection pursuant to Art. 21 (1) GDPR, a balance must be struck between your interests and ours. As long as it has not yet been determined whose interests prevail, you have the right to request the restriction of the processing of your personal data."
    },
    "processing_restriction_right_text_2": "If you have restricted the processing of your personal data, this data may - apart from its storage - only be processed with your consent or for the establishment, exercise or defense of legal claims or for the protection of the rights of another natural or legal person or for reasons of important public interest of the European Union or a Member State.",
    "ssl_tls_encryption_title": "SSL/TLS Encryption",
    "ssl_tls_encryption_text": "For security reasons and to protect the transmission of confidential content, such as orders or inquiries that you send to us as the site operator, this site uses SSL or TLS encryption. You can recognize an encrypted connection by the fact that the address line of the browser changes from “http://” to “https://” and by the lock symbol in your browser line. If SSL or TLS encryption is activated, the data you transmit to us cannot be read by third parties."
  },
  "terms_of_service": {
    "last_updated": "Last Updated: August 30, 2025",
    "title": "Terms and Conditions of Swim Gen",
    "intro": "These Terms govern the use of this Application, and, any other related Agreement or legal relationship with the Owner in a legally binding way. Capitalized words are defined in the relevant dedicated section of this document.",
    "read_carefully": "The User must read this document carefully.",
    "provided_by": "This Application is provided by:",
    "owner": "Swim Gen",
    "owner_contact": "Owner contact email: {mail}",
    "at_a_glance_title": "What the User should know at a glance",
    "at_a_glance": "Please note that some provisions in these Terms may only apply to certain categories of Users. In particular, certain provisions may only apply to Consumers or to those Users that do not qualify as Consumers. Such limitations are always explicitly mentioned within each affected clause. In the absence of any such mention, clauses apply to all Users.",
    "terms_of_use_title": "TERMS OF USE",
    "terms_of_use": "Unless otherwise specified, the terms of use detailed in this section apply generally when using this Application.",
    "additional_conditions": "Single or additional conditions of use or access may apply in specific scenarios and in such cases are additionally indicated within this document.",
    "requirements": "By using this Application, Users confirm to meet the following requirements:",
    "requirements_list": {
      "0": "There are no restrictions for Users in terms of being Consumers or Business Users;"
    },
    "content_title": "Content on this Application",
    "content": "Unless where otherwise specified or clearly recognizable, all content available on this Application is owned or provided by the Owner or its licensors.",
    "content_effort": "The Owner undertakes its utmost effort to ensure that the content provided on this Application infringes no applicable legal provisions or third-party rights. However, it may not always be possible to achieve such a result. In such cases, without prejudice to any legal prerogatives of Users to enforce their rights, Users are kindly asked to preferably report related complaints using the contact details provided in this document.",
    "rights_title": "Rights regarding content on this Application - All rights reserved",
    "rights": "The Owner holds and reserves all intellectual property rights for any such content.",
    "rights_usage": "Users may not therefore use such content in any way that is not necessary or implicit in the proper use of the Service.",
    "rights_prohibited": "In particular, but without limitation, Users may not copy, download, share (beyond the limits set forth below), modify, translate, transform, publish, transmit, sell, sublicense, edit, transfer/assign to third parties or create derivative works from the content available on this Application, nor allow any third party to do so through the User or their device, even without the User's knowledge.",
    "rights_personal_use": "Where explicitly stated on this Application, the User may download, copy and/or share some content available through this Application for its sole personal and non-commercial use and provided that the copyright attributions and all the other attributions requested by the Owner are correctly implemented.",
    "rights_limitation": "Any applicable statutory limitation or exception to copyright shall stay unaffected.",
    "user_content_title": "Content provided by Users",
    "user_content": "The Owner allows Users to provide content to this Application, primarily for the purpose of donating training plans to improve the service.",
    "user_content_confirm": "By providing content to this Application, Users confirm that they are legally allowed to do so and that they are not infringing any statutory provisions and/or third-party rights.",
    "external_resources_title": "Access to external resources",
    "external_resources": "Through this Application Users may have access to external resources provided by third parties. Users acknowledge and accept that the Owner has no control over such resources and is therefore not responsible for their content and availability.",
    "external_resources_conditions": "Conditions applicable to any resources provided by third parties, including those applicable to any possible grant of rights in content, result from each such third parties' terms and conditions or, in the absence of those, applicable statutory law.",
    "acceptable_use_title": "Acceptable use",
    "acceptable_use": "This Application and the Service may only be used within the scope of what they are provided for, under these Terms and applicable law.",
    "acceptable_use_responsibility": "Users are solely responsible for making sure that their use of this Application and/or the Service violates no applicable law, regulations or third-party rights.",
    "acceptable_use_rights": "Therefore, the Owner reserves the right to take any appropriate measure to protect its legitimate interests including by denying Users access to this Application or the Service, terminating contracts, reporting any misconduct performed through this Application or the Service to the competent authorities – such as judicial or administrative authorities - whenever Users engage or are suspected to engage in any of the following activities:",
    "acceptable_use_list": {
      "0": "violate laws, regulations and/or these Terms;",
      "1": "infringe any third-party rights;",
      "2": "considerably impair the Owner's legitimate interests;",
      "3": "offend the Owner or any third party."
    },
    "privacy_policy_title": "Privacy policy",
    "privacy_policy": "To learn more about the use of their Personal Data, Users may refer to the privacy policy of this Application.",
    "ip_rights_title": "Intellectual property rights",
    "ip_rights": "Without prejudice to any more specific provision of these Terms, any intellectual property rights, such as copyrights, trademark rights, patent rights and design rights related to this Application are the exclusive property of the Owner or its licensors and are subject to the protection granted by applicable laws or international treaties relating to intellectual property.",
    "ip_rights_trademarks": "All trademarks — nominal or figurative — and all other marks, trade names, service marks, word marks, illustrations, images, or logos appearing in connection with this Application are, and remain, the exclusive property of the Owner or its licensors and are subject to the protection granted by applicable laws or international treaties related to intellectual property.",
    "changes_title": "Changes to these Terms",
    "changes": "The Owner reserves the right to amend or otherwise modify these Terms at any time. In such cases, the Owner will appropriately inform the User of these changes.",
    "changes_effect": "Such changes will only affect the relationship with the User for the future.",
    "changes_acceptance": "The continued use of the Service will signify the Users acceptance of the revised Terms. If Users do not wish to be bound by the changes, they must stop using the Service. Failure to accept the revised Terms, may entitle either party to terminate the Agreement.",
    "changes_previous": "The applicable previous version will govern the relationship prior to the User's acceptance. The User can obtain any previous version from the Owner.",
    "changes_law": "If required by applicable law, the Owner will specify the date by which the modified Terms will enter into force.",
    "assignment_title": "Assignment of contract",
    "assignment": "The Owner reserves the right to transfer, assign, dispose of by novation, or subcontract any or all rights or obligations under these Terms, taking the User's legitimate interests into account. Provisions regarding changes of these Terms will apply accordingly.",
    "assignment_user": "Users may not assign or transfer their rights or obligations under these Terms in any way, without the written permission of the Owner.",
    "contacts_title": "Contacts",
    "contacts": "All communications relating to the use of this Application must be sent using the contact information stated in this document.",
    "severability_title": "Severability",
    "severability": "Should any provision of these Terms be deemed or become invalid or unenforceable under applicable law, the invalidity or unenforceability of such provision shall not affect the validity of the remaining provisions, which shall remain in full force and effect.",
    "governing_law_title": "Governing law",
    "governing_law": "These Terms are governed by the law of the place where the Owner is based, as disclosed in the relevant section of this document, without regard to conflict of laws principles.",
    "venue_title": "Venue of jurisdiction",
    "venue": "The exclusive competence to decide on any controversy resulting from or connected to these Terms lies with the courts of the place where the Owner is based, as displayed in the relevant section of this document.",
    "dispute_title": "Dispute resolution",
    "amicable_title": "Amicable dispute resolution",
    "amicable": "Users may bring any disputes to the Owner who will try to resolve them amicably.",
    "amicable_right": "While Users' right to take legal action shall always remain unaffected, in the event of any controversy regarding the use of this Application or the Service, Users are kindly asked to contact the Owner at the contact details provided in this document.",
    "amicable_complaint": "The User may submit the complaint including a brief description and if applicable, the details of the related order, purchase, or account, to the Owner's email address specified in this document.",
    "amicable_process": "The Owner will process the complaint without undue delay and within 21 days of receiving it."
  },
  "errors": {
    "unknown_error": "An unknown error occurred. Please try again later.",
    "health_check_failed": "Health check failed. Please try again later.",
    "training_plan_failed": "Failed to generate training plan. Please check your input and try again.",
    "failed_to_generate_prompt": "Failed to generate prompt",
    "failed_to_generate_plan": "Failed to generate plan",
    "failed_to_export_plan": "Failed to export training plan to PDF.",
    "timeout": "Request timed out after {time} seconds. Please try again.",
    "connection_failed": "Failed to connect to the server. Please check your internet connection and try again.",
    "api_request_failed": "API request failed for {endpoint}",
    "fetch_shared_plan_failed": "Failed to fetch shared training plan. It may have been deleted or is no longer available."
  },
  "login": {
    "login": "Login",
    "logout": "Logout",
    "signUp": "Sign Up",
    "email": "Email",
    "password": "Password",
    "username": "Username",
    "loading": "Loading...",
    "needAccount": "Need an account? Sign Up",
    "haveAccount": "Already have an account? Login",
    "checkEmail": "You should receive a confirmation email shortly. Please check your inbox.",
    "invalidLogin": "Invalid login credentials. Please try again.",
    "emailNotConfirmed": "Email not confirmed. Please check your email for the confirmation link.",
    "registrationFailed": "Registration failed. Please try different credentials.",
    "loginSuccess": "Login successful!",
    "registrationSuccess": "Registration successful! Please check your email to confirm your account.",
    "usernameTaken": "Username already taken. Please choose a different one.",
    "userExistsLoginSuccess": "User already exists, login successful!",
    "userExistsLoginFailed": "User already exists, but login failed. Please check your credentials.",
    "unknownError": "An unknown error occurred. Please contact support.",
    "logoutSuccess": "You have been logged out successfully.",
    "logoutFailed": "Logout failed. Please try again.",
    "upsert_failed": "Failed to update plan. Please try again."
  },
  "profile": {
    "title": "Profile",
    "description": "Hello, {user}. Here you can view and edit your personal information, track your usage statistics, and manage your account.",
    "your_information": "Your Information",
    "info_description": "Your profile information is used to improve and personalize the generation of your training plans.",
    "experience": "Experience",
    "experience_explanation": "Your swimming experience level.",
    "preferred_strokes": "Preferred Strokes",
    "preferred_strokes_explanation": "Your preferred swimming strokes.",
    "categories": "Categories",
    "categories_explanation": "Your user categories.",
    "edit_profile": "Edit Profile",
    "save": "Save",
    "saving": "Saving...",
    "generated_plans": "Generated Plans",
    "generated_plan_tooltip": "Total number of training plans generated with your account.",
    "exported_plans": "Exported Plans",
    "exported_plan_tooltip": "Total number of training plans exported to PDF with your account.",
    "monthly_quota": "Monthly Quota",
    "monthly_quota_tooltip": "Number of advanced training plans you can generate per month. Advanced plans are plans in chat-mode or multi-plan requests. The quota resets on the first day of each month.",
    "delete_account": "Delete Account",
    "delete_account_warning": "Permanently delete your account and all associated data. This action cannot be undone.",
    "delete_account_button": "Delete Account",
    "delete_account_title": "Delete Your Account",
    "delete_account_confirmation": "Are you sure you want to permanently delete your account? This will remove all your training plans, history, feedback, and profile data. Shared plans will not be available to others anymore. This action cannot be undone.",
    "delete_account_instruction": "To confirm, type DELETE in the field below:",
    "delete_account_placeholder_input": "Type DELETE to confirm",
    "delete_account_confirm": "Delete My Account",
    "delete_error": "Failed to delete account. Please try again.",
    "deleting": "Deleting...",
    "cancel": "Cancel",
    "experience_beginner": "Beginner",
    "experience_advanced": "Advanced",
    "experience_competitive": "Competitive",
    "category_triathlete": "Triathlete",
    "category_swimmer": "Swimmer",
    "category_coach": "Coach",
    "category_hobby": "Hobby",
    "no_selection_placeholder": "No selection yet",
    "freestyle": "Freestyle",
    "breaststroke": "Breaststroke",
    "backstroke": "Backstroke",
    "butterfly": "Butterfly",
    "individual_medley": "Individual Medley"
  },
  "sidebar": {
    "history": "Your plans",
    "generated": "Generated plans",
    "generated_placeholder": "No generated plans yet.",
    "uploaded": "Uploaded plans",
    "uploaded_placeholder": "No plans uploaded yet.",
    "shared": "Plans shared with you",
    "shared_placeholder": "No plans shared with you yet.",
    "create_new": "New Plan",
    "upload_plan": "Upload Plan",
    "tooltip_temporary": "Temporary plan - will be deleted after 2 days",
    "tooltip_permanent": "Permanent plan - kept forever",
    "menu_delete": "Delete",
    "menu_edit_title": "Edit Title",
    "menu_share": "Share",
    "confirm_delete_plan": "Are you sure you want to delete this plan? This action cannot be undone.",
    "confirm_delete_shared": "Are you sure you want to delete this shared plan? This action cannot be undone.",
    "confirm_delete_uploaded": "Are you sure you want to delete this uploaded plan? This action cannot be undone.",
    "search_placeholder": "Search generated plans...",
    "search_no_results": "No plans match your search.",
    "search_results_info": "Showing {count} result(s). Clear search to load more.",
    "load_more": "Load More"
  },
  "donation": {
    "title": "Upload Training Plan",
    "intro": "Here you can upload your training plan. It will be stored in your account. You may either upload a PDF or image file, or input the plan manually. After saving this plan, it is available for further use.",
    "allow_sharing": "Allow others to see results based on this plan",
    "submit": "Save Plan",
    "loading": "Uploading plan...",
    "success_toast": "Plan saved successfully!",
    "error_toast": "Failed to save plan: {error}",
    "no_plan_toast": "The saved plan could not be found.\n{error}",
    "newPlan": {
      "title": "New Plan",
      "description": "No description provided.",
      "warmup": "Warmup",
      "total": "Total"
    },
    "title_required": "Please provide a title for your plan.",
    "upload_image_btn": "Upload File to Extract Plan",
    "processing_image": "Processing File...",
    "upload_image_hint": "Upload a file (PNG, JPEG, or PDF) of a swimming plan to automatically extract it.",
    "image_upload_success": "Plan extracted successfully!",
    "image_upload_error": "Failed to extract plan from file.",
    "view": {
      "title": "Uploaded Plan",
      "description": "This plan was uploaded by you. You may edit, share or export it. If you want to create variations of this plan, feel free to use interactive editing below."
    }
  },
  "labels": {
    "created_at": "Created at",
    "updated_at": "Updated",
    "exported_at": "Exported"
  },
  "share": {
    "fetching_url": "Fetching shareable URL...",
    "show_url": "Share this URL to share your training plan:",
    "copy": "Copy Link",
    "copied": "Copied!",
    "share_plan": "Share Plan"
  },
  "interaction": {
    "save_to_history": "Add to History",
    "snapshot_saved": "Snapshot added to history!",
    "not_found": "Plan not found.",
    "no_messages": "No messages in this conversation yet.",
    "you": "You",
    "ai": "Swim Gen",
    "conversation_tab": "Interactive Editing",
    "plan_tab": "Training Plan",
    "hide_plan": "Hide Plan",
    "show_plan": "Show Plan",
    "give_feedback": "Give Feedback",
    "rate_plan": "Rate Plan",
    "metadata": "Metadata",
    "created_at": "Created At",
    "updated_at": "Updated At",
    "exported_at": "Exported At",
    "chat_placeholder": "Type a message...",
    "describe_changes": "Describe your desired changes"
  },
  "shared": {
    "loading": "Loading shared training plan...",
    "hero_title": "Shared Training Plan",
    "hero_description_one": "You are viewing a training plan shared by ",
    "hero_description_two": ". You can edit this plan, export it for use at the pool, or generate a new one based on your own needs. Edits are saved in your history and not fed back to {username}.",
    "no_plan_toast": "The shared plan could not be found.\n{error}",
    "register_to_save": "Register an account or login to save and manage this shared training plans.",
    "unknown_user": "Unknown User",
    "start_conversation": "Interactive editing"
  },
  "feedback": {
    "title": "How was your training?",
    "subtitle": "Feedback for: {plan}",
    "thank_you": "Thank you for taking the time to give us your feedback. Your input helps us improve training plans for everyone!",
    "rating_label": "Overall Rating",
    "swam_label": "I swam this plan",
    "difficulty_label": "Difficulty",
    "easy": "Easy",
    "hard": "Hard",
    "comment_label": "Comment",
    "comment_placeholder": "What did you like? What could be improved?",
    "disclaimer": "Your feedback helps us improve the training plans for everyone.",
    "submit_success": "Thank you for your feedback!"
  },
  "common": {
    "submit": "Submit",
    "loading": "Loading...",
    "optional": "optional"
  }
}
